/*
 * ============================
 * 			&(*)	|(+)	^
 * ============================
 * 00        0        0     0
 * ============================
 * 01        0        1     1
 * ============================
 * 10        0        1     1
 * ============================
 * 11        1        1     0
 *
 * 	10&5 = 1010
 *         0101 => 0000 ==> 0 출력   
 * 
 * 	12&8 = 1100
 *         1000 => 1000 ==> 8 출력
 *         
 *  17|10 = 10001
 *          01010 => 11011 ==>27
 *          
 *  10^5 = 1010
 *         0101 => 1111 ==>15
 * 
 * 
 */
public class 비트연산자 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		System.out.println("10&5="+(10&5));
		System.out.println("17&10="+(17&10));
		System.out.println("18&10="+(18&10));
		
		System.out.println("10|5="+(10|5));
		System.out.println("17|10="+(17|10));
		System.out.println("18|10="+(18|10));
		
		System.out.println("10^5="+(10^5));
		System.out.println("17^10="+(17^10));
		System.out.println("18^10="+(18^10));
		
		
	}

}
